app/Http/Controllers/Frontend/ShopController.php

    public function index()
    {
        $products = Product::with('category')->get();
---
select * from `categories` where `categories`.`id` in (1, 2)
select * from `products`

    public function category($id)
    {
        $category = Category::find($id);
        $products = Product::with('category')
            ->where('category_id', $id)
            ->get();
---
select * from `categories` where `categories`.`id` = '1' limit 1
select * from `categories` where `categories`.`id` in (1)
select * from `products` where `category_id` = '1'