app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        View::share('categories', Category::all());
---
select * from `categories`