packages/jinal/catalog/src/Repositories/CategoryRepository.php

    public function all()
    {
        return Category::all();
---
select * from `categories`

    public function create(array $data)
    {
        return Category::create($data);
---
insert into `categories` (`name`, `updated_at`, `created_at`) values ('fddfdfsdfd', '2026-04-09 06:14:39', '2026-04-09 06:14:39')

    public function find($id)
    {
        return Category::findOrFail($id);
---
select * from `categories` where `id` in ('1')

    public function delete($id)
    {
        return Category::destroy($id);
---
delete from `categories` where `id` = 1