app/Http/Controllers/Admin/CategoryController.php

select count(*) as aggregate from `categories`
select * from `categories` order by `created_at` desc
---
   public function index()
{
    $this->authorize('viewAny', Category::class);
    // Fetch categories with pagination (e.g., 10 per page)
    return $categories = Category::latest()->paginate(10);

select * from `categories` where `parent_id` is null order by `name` asc
---
public function create()
{
    $this->authorize('create', Category::class);

    $parentCategories = Category::whereNull('parent_id')
        ->orderBy('name')
        ->get();

insert into `categories` (`name`, `parent_id`, `updated_at`, `created_at`) values ('hhhh', '58', '2026-04-16 12:14:25', '2026-04-16 12:14:25')
---
    public function store(Request $request)
    {
        $this->authorize('create', Category::class);

  $request->validate([
            'name' => 'required',
            'parent_id' => 'nullable|exists:categories,id'
        ]);

        Category::create($request->only('name','parent_id'));

select * from `categories`
---
    public function edit(Category $category)
    {
        $this->authorize('update', $category);

      $categories = Category::all();

update `categories` set `name` = 'sdsdsdjinal', `categories`.`updated_at` = '2026-04-16 12:39:25' where `id` = 1
---
    public function update(Request $request, Category $category)
    {
        $this->authorize('update', $category);

     $request->validate([
            'name' => 'required',
            'parent_id' => 'nullable'
        ]);

        $category->update($request->only('name','parent_id'));

delete from `categories` where `id` = 58
---
    public function destroy(Category $category)
    {
        $this->authorize('delete', $category);

       $category->delete();